{
            "With lies.",
            "Good tactic",
            "I'm too honest sometimes.",
            "A goofball, but also a shy dumbass.",
            "Subdued until I really get to know someone.",
            "Just check my profile",
            "I am polite but not friendly. I do not feel the need to hang around with others and spend most of my time reading, listening to music, gaming or watching films. Getting to know me well is quite a challenge I suppose, but my few friends and I have a lot of fun when we meet (usually at university or online, rarely elsewhere irl). I'd say I am patient, rational and a guy with a big heart for the ones I care for.",
            "I could send you my big five, but I doub't that you would really know what to do with it",
            "Big five? I don’t know what that is.",
            "Shy. Somewhat eccentric.",
            "Random, chaotic and wanting cuddles",
            "Chaotic altruism.",
            "Chaotic, sarcastic, pessimistic and extroverted",
            "With great exaggeration",
            "Sad",
            "mature moody teenager",
            "Mature kid with a short fuse for stupid",
            "Unrelatable, self disciplined, direct & too serious for most people",
            "Unrelatable is a strange one",
            "horny hungry sleepy repeat",
            "Low light? No problem.",
            "Some of the best times happen when the sun’s down. Capture the night with crystal-clear, bright pics and videos, no matter the lighting with Nightography. Nightography lets you snap or record every single moment clearly, regardless of light. Galaxy S22 and S22+ also feature an incredible all-day battery that can power through a night of endless adventures. What will your epic moment be? The possibilities are limitless.",
            "www.samsung.com/us/smartphones/galaxy-s22/",
            "Wet cardboard",
            "Perfectionist.",
            "[Which makes me an a-hole unfortunately]",
            "It classified",
            "Nihilistic int-j",
            "Whichever character I like best from the series I'm currently watching.",
            "Or the type I think my current series character crush would be interested in irl",
            "Self-destructive, alcoholic, mentally fucked up and overall fed up.",
            "Melancholic.",
            "I find it difficult to interact with people irl",
            "INFP",
            "Pretty shitty, not gonna lie",
            "Disgruntled potato forgotten under the sink.",
            "Also INTP / 5, no wing.",
            "INFP",
            "Misunderstood.",
            "I don’t even know",
            "Avoidant",
            "Ridiculously high achieving and attention seeking in a (mostly very successful) attempt to hide deep insecurity",
            "INTP",
            "The public version of me is nice, always helpful, generally cheerful, a bit sarcastic. I’m a laid back person and I love mucking around and being silly. Everything is fine, nothing bad going on, out on a big smile.",
            "The private version of me is the above, but also sad, lonely, easily self-sabotaging, I have a ‘fuck off shield’ up and don’t let people get too close.",
            "Intj; ie a walking contradiction.",
            "Cocky asshole, narcissistic, somehow funny",
            "Using humor to cope with insecurity.",
            "Popular nerd who doesn't have friends :')",
            "Shitty",
            "complicated",
            "Enthusiastic but Sensitive.",
            "A little bit of happiness surrounded by a fuckton of violence.",
            "EAT.SHIT.DIE",
            "it's true eating shit is toxic",
            "Not nearly as witty as I think I am.",
            "Pleasant half the time, the other half completely and unashamedly confrontational in the most over the top way to dickheads in my life, which there are many",
            "A humble Kanye West, trapped in the body of a dark Danny Devito.",
            "A little much. A liability",
            "Draining.",
            "Introverted and neurotic",
            "Fabricated.",
            "Gay",
            "Really friendly and (mostly) open dude, who's always ready with a pun, encouragement, or consolation if need be. I genuinely like people and like hanging out with them, and I think it shows. And also has mild depression that occasionally crops up, leading to me spending the best part of two weeks in my room playing video games and listening to music. I kinda live through other people, and often put their happiness above my own sometimes.",
            "More of a lone wolf who has the most enjoyment being alone.",
            "Others report that they struggle to pin me down, which is an interesting trait in its own right, I suppose.",
            "Alice in Wonderland with a hint of Lisbeth Salander.",
            "Goofy. Quiet. Serious. Silly. It really depends on the situation.",
            "Like when vanilla meets chocolate, only more racist.",
            "I'm very \"out there\". I will say what I think, and I don't care if it's unladylike or if it offends you. I'm also just really dudeish. I get called a man all the time cause I make jokes that generally guys laugh at but not girls. And I burp in public. I'm trashy.",
            "No comment.",
            "Too lazy to do anything including writing down my entire personality",
            "A glass box with a man inside who enjoys books, games and relaxing. He does not go out of the box to talk with anyone, but will happily let anyone else into his little world.",
            "Internal",
            "Self-loathing bitchiness, if I had to boil it down. Think PMS but 24/7.",
            "Online asshole.",
            "An introvert 75% of the time, Energized by a certain number of people 25% of the time.",
            "I love making people laugh. I'm usually the peacemaker, and I'm usually the shot caller in my group of nerds.",
            "I'm also a stubborn procrastinator. I stand firm behind my beliefs while disliking being wrong. I change my beliefs on my own accord, nothing anybody else says in an argument can change my mind when I'm angry.",
            "I'm very polite around authority figures.",
            "I have a very acute sense of JUSTICE.",
            "I dislike tedious nonsense tasks.",
            "Holy shit you sound a lot like me.",
            "I was in a toxic relationship, and my ex and I would say I would go from princess to ghetto in a heartbeat.",
            "Not the best. Almost a year later since the breakup, and I feel so liberated and not stressed out. Not true anymore.",
            "Depends on who I'm with.",
            "Makes sense",
            "Little bit sassy, little bit rock'n'roll",
            "But actually a complete nerd",
            "Disorderly.",
            "Unconditional love for everyone and everything. Just kinda trying my best to make it through life. I like fishing, seeing pretty sights, and helping people with whatever.",
            "I care too much to the point that I don’t care",
            "Care to explain?",
            "Lots of stoicism until I really get to know someone, then goofy",
            "Loud, sarcastic, and honest. Like a much less funny much less attractive Ryan Reynolds.",
            "Warm but very detached. A very close acquaintance. All smiles.",
            "Detached and close?",
            "Drier than Death Valley, but I find almost everything funny in some way. Super easy going. If you aren't a dickhead, and aren't trying to kill me, my family, or my friends I can probably get along with you. I can literally find any reason to not care about most things.",
            "Introverted. Dealing with people absolutely drains me.",
            "People tell me I'm really nice and don't get worked up about stuff, but the truth is I just don't have the energy.",
            "My true personality is someone who you can talk to without being afraid of being judged or that talk will be spread, also I like to helo people but only if they diserve and need help assholes and lazy people aren't welcome to my life, also I like 90's rap but am open to any song as long as it's message is good. From time to time I can pop a good joke.",
            "chaotic good, of lawful neutral.",
            "I took one of those Big 5 personality tests and it said I was introverted, extremely neurotic, and extremely open to experience. The other two were average. And according to MBTI I’m an INFP",
            "ISTP",
            "Like a king size snickers bar with a razor blade in it",
            "Interesting",
            "Asshole with a heart of gold.",
            "I think when someone first meets me they won't really know what to think. I'm a tall, quiet, well-built white guy. That could be any number of things right there. I guess I'm a little dry and cynical sounding at first, but I think I'm just waiting for you to talk first so I can get a better read about your personality before showing mine.",
            "I like to make people laugh. Once I've learned enough about you the first thing I can do is make you laugh. People like to laugh. I like to make people laugh. People will like me if they laugh. I will like that people will like me when they laugh. That makes me feel good about myself. Most people think I'm really funny. There's too many types of humor for me to appeal to at once sometimes I think. My own personal sense of humor doesn't align too well with other people too, so maybe for every ten times I do/say something funny, the average person might only get the joke 6 of those times. End result is that I'm a little weird to a lot of people too. They like me, but they don't really understand what I'm saying some of the time. Different tastes in humor. But I like to make people feel good about themselves.",
            "I like to help people too. I used to do a lot of volunteer work, but I don't have time at this point in my life. That makes me a little bit sad. I'll always lend a hand when its needed though. I hope people know that. I'll especially help you emotionally though. I've helped friends get over breakups and girl problems. Comforted people with depression. I've been there. I can help you get out. I think I've stopped suicides before. On Omegle and Kik there are a lot of very lonely people who could use a friend. I've been able to talk people out of being destructive, and coach them along to get help. That's not how most people know me though. Only when I'm really worried about someone or something will I really touch them somewhere meaningful. I think it's an important ability of mine, but I don't do it often because I'm really sensitive myself. I can pick up on people's feelings and reflect enough back at them to connect with them and help them, but not too much as to hurt them. Sometimes their feelings stick with me a bit though and it can be unmanageable.",
            "Sometimes I'm afraid that people will remember times when I've been mean. I don't want to be mean, but I think everyone has moments where they are clumsy with thoughts or words. I think my biggest fear is hurting people I care about. Especially since I know how easy it is.",
            "I don't think people realize that I'm lonely too. Dozens of friends. Hundreds of smiles. People everywhere love me. I help strangers and feel their gratitude. There's no reason why I would ever feel lonely, and yet I'm still missing something. Or someone.",
            "I think I'm afraid that i'm becoming depressed again myself. Things fell through with someone that mattered to me, and now I'm afraid of being lonely again.",
            "I don't think people like me are very common, and I don't think I'll be as happy as I could be until I find someone like me.",
            "I think you're a good person. You have people who care about you, and people you care about. Be good to the people you've been so lucky to find.",
            "r/infp Your personality sounds like mine . Sensitive. Empathetic. Caring. Go check them out!",
            "Lumbago",
            "Damn it uncle",
            "Petty",
            "Like a bowl of Raisin Bran, only there's no milk and someone picked all the raisins out.",
            "So a bowl of cornflakes?",
            "3/10",
            "Depending on how you look at it, either a mean sonuvabitch with a soft side or a sweetheart with a mean streak.",
            "Spicy",
            "You’re* fuck",
            "You had it right in the title mate",
            "detached but friendly",
            "This is a hard one. Most people that meet me, and even know me well, tell me I’m one of the nicest people they’ve ever met (I was voted “nicest person” in 8th grade) but I don’t feel that way at all. I feel like if they knew my thoughts, they wouldn’t believe that. I’m quite critical and cynical, though I mostly keep it in my thoughts and in my reddit comments, hahaha. I do try to be a good person though, and I would say I’m fairly generous and loyal. I care deeply, but that also means I get worked up over injustice easily.",
            "Are you me?",
            "Friendly cat",
            "I’m a really open hearted, giving, loving person. Though I get wrapped up in emotions very easily and that sends me into a downward spiral of depression. I always want my love to be reciprocated which is so selfish I know. Another horrible thing about me is that I seek attention. I have a loud personality. Most people find me a lot of fun to be around but for some I might be too intense. I’m complicated 😐",
            "Fucking annoying and self centered.",
            "An anxious mess inside of a goofy nerd wrapped in a super serious facade.",
            "I’m exhausted just trying to think of how I would answer this question",
            "i don’t know my personality. funny? boring? quiet? i honestly don’t know and it’s going to stay like that for a long time.",
            "Everyone calls me \"the calmest person\" they know. Like my life is falling apart in front of me, but I'm not stressed out in the slightest kind of calm.",
            "Mm what else? I'm usually quiet and observant, but tend to be very stubborn about stupid things. Also I tend to lie a lot for no reason at all (I'm trying to change this though!)",
            "Ever changing.",
            "Happy and innocent on the outside. Happy and almost innocent on the inside. People say I care to much about other people’s feelings",
            "Funny, friendly and selective",
            "Quite sensitive and emotional, but passionate.",
            "Bright and friendly.",
            "smart ass, caring, emotional yet struggles to convey emotion, funny without meaning to be, unique, intelligent, spot on intuition about people",
            "People generally tell me that before they got to know me they were scared of me or thought I was cool. I personally just see myself as kind of distant and detached but I also care deeply about lots of things. Also I have really thin skin and it kind of shows.",
            "Outgoing, curious, passionate, and supportive, but also anxious and kind of awkward depending on the person I'm interacting with",
            "Introverted but fun once you break through the shell.",
            "doormat with a big heart, will take on everyones emotions and responsibility, big heart made of glass.",
            "Bratty but sweet so I’ve been told.",
            "Salty.",
            "Snarky, yet extremely loving... if you deserve it... otherwise just snarky haha",
            "I will cheerfully get into a fight to defend something I care about.",
            "i care about others more than they care for me. i’m friendly to all, but friends to a few. i don’t take shit from anybody and i’m not afraid to cut people off. protective to those close to me. observant. not quiet but not quite loud. compassionate. independent but really decisive. hardworking and determined. open minded.",
            "Your comment has been removed:",
            "Removed for ableism.",
            "Have questions about this moderator action? CLICK HERE!",
            "If you are messaging about your removed comment or post, please include a link to the removed content for review.",
            "AskWomen rules | AskWomen FAQ\nreddit rules | reddiquette",
            "Odd😂",
            "Always tired lol",
            "Chipper but distant",
            "\"Feral cat\" gets thrown around a lot when others describe me.",
            "Standoffish, I suppose.",
            "Agreeable",
            "Friendly, approachable, extremely caring but annoying and perpetually sad so that can make it not so fun to be around me.",
            "Emotionally hyperactive.",
            "It ebbs and flows between modest, friendly, goofy, and snarky. It depends who I’m around.",
            "bubbly, outgoing, flirty, bratty at times",
            "Serious, reserved, stoic. I am warmer with friends and family, but it takes a lot for me to let my guard down.",
            "It’s aight.",
            "Women specifically.",
            "That I'm funny, an overthinker, and too much of a homebody. Basically I'm at home laughing at the things I'm thinking about.",
            "I'd say we should hang out but on second thought...",
            "😂 oh man this is me",
            "I'm EXTREMELY introverted. I'm not shy and I don't just hate everybody, it just takes SO much energy for me to socialize that it's not worth the effort for me most of the time. When I go out to parties or bars I get FOMO of being at home watching netflix in bed. Haha",
            "What does FOMO mean?",
            "Independent. I've lived overseas for 9 years and uprooted my life and changed continents 3 times (so far). I'm used to people coming and going and having to rely on myself for everything. This is probably why I haven't had a boyfriend in years, I'm happy on my own and just can't be bothered to pretend like I need a man 😂",
            "Same tho (except less drastic moves).",
            "I like learning new things, I prefer to be left alone, I like being odd, and I am very nurturing towards animals and the people I let in my life",
            "Jane Goodall?!",
            "I'm intelligent and a quick learner, I'm a people pleaser and I'm highly organised. I'm also very opinionated and love a good debate but I'll only be like that around friends.",
            "Asocial. I'm extremely introverted & reclusive. I happen to be highly independent & self-sufficent. I prefer my own company to that of anyone I've ever met. I'd rather books over people any day.",
            "I'm introverted & reclusive, too. I like your screen name, very cool.",
            "Well I don’t know how to describe myself.",
            "I'm very friendly, laugh a lot and get along with almost everybody. I'm chatty and smart.",
            "Opinionated, sarcastic, artsy.",
            "I'm like 70% sarcasm and witty comebacks, 20% movie and tv show references, 10% everything else.",
            "I'm cold and aloof. I have RBF and the personality to go along with it.",
            "Very loyal, sarcastic, outspoken, honest, talkative",
            "I'm autistic. Whether I like it or not that will always be my most defining character trait because it operates on a level lower than any other traits I might have.",
            "I don’t take people’s shit. This has been my M-O since high school apparently.",
            "I'm sensitive (which is both good and bad), very studious, a perfectionist (to an obsessive level), anxious, and empathetic. I'm passionate about certain issues and can sometimes be too reactionary regarding them. However, I hate to see anyone sad, even people I dislike, and most people IRL describe me as being \"sweet.\" I'm also a bit of a pessimist, which I wish I could change.",
            "I'm quiet and very much an introvert, but I'm not shy or lacking in confidence, either. I just prefer to stay in the background and listen and think. My friends also tend to describe me as logical and calm (even though, internally, I tend to be a bit on the anxious side).",
            "That I'm very shy and it takes a while for me to be comfortable around people. Also really dislike conflict and will go out of my way to avoid it or prevent it from happening. But that makes me easy to get along with because I'm not going to start shit, so hey!",
            "I'm loud, in a lot of ways. Volume, personality, dress, actions. I can just be summed up as loud, probably because I'm unrepentantly weird and true to myself.",
            "I'm very brave, I'm a bit arrogant and hate being wrong, I'm earnest and sentimental but I've also got a streak of mean girl in me and can be extremely judgmental.",
            "I'm super optimistic and positive. Pretty much everybody asks me how I can be so happy/excited all the time.",
            "Funny/sassy",
            "I’m a weirdo and a bit of a nerd. I like being alone. I learned to read at 3 years old and was ahead of my peers. As a child I was considered “gifted” intellectually but socially stunted. I didn’t relate well to other kids. My mom’s friend once asked if I was autistic. I’m not a genius or anything but I consider myself intelligent. I’m opinionated, stubborn and a natural leader and very independent. I have a hot temper and can be impatient. In my professional life I’m very anal, meaning orderly, organized and perfectionist, but in my personal life I am messy and scatterbrained. I think my personality is off-putting to certain other personality types. What can I say? I’m me and don’t plan on changing who I am to please anyone.",
            "I've been told (so many times that I've come to see it myself) that I have an inhuman amount of patience with everything(except myself). I've also been told that i'm incredibly kind and compassionate towards everyone. I'll go out of my way to make things better for other people but its to a fault that i do so. I have the tendency to put everyone before myself but i have gotten better about that over the last year.",
            "I always try to make someone laugh to break the conversation (unless it's a super serious topic). Comes in handy to break the mood and get new people to like me. =)",
            "I'm loyal and witty. I think that's what my friends appreciate the most about me.",
            "My passion for animals and the environment.",
            "I'm very compassionate/empathetic, a really good listener who gives good advice (I've been called wise too many times), creative, and I have an old soul.",
            "Funny, likes to be center of attention, can't hide emotions on my face (good or bad), outspoken, flirty",
            "you know that thing that you aren't supposed to say, because it could be construed as hurtful or mean? that thing that you and a friend think is funny just out of context and you say it when that friend isn't around? that thing that you shouldn't under ANY circumstances say out loud? Yeah. I say it anyway.",
            "I think I am very empathetic and open-minded. Sometimes it can be a fault.",
            "I'm also an extremely focused person. I'm also very introverted but I would probably describe myself as \"pleasant\". I can be a bit silly and goofy when meeting new people because I find that it makes other people more relaxed being around me.",
            "I’m sarcastic AF, have severe resting bitch face, I overthink EVERYTHING, and I’m entirely too expressive with my face, meaning every single emotion or thought I have is usually written all over it. It gets me into trouble sometimes! The older I become, the more of a feminist I become, and ranting upon my soapbox(as my husband puts it) is one of my fav things to do! I prefer chilling at home with my hubs and kitties than going out to party, I’m essentially a sassy grandma trapped in a late 20yr olds body!",
            "Positives I'm known for: Generous attitude, sensitive, calm, and hard working.",
            "Negatives: Mouthy, spends too much time in my head, procrastinator, can take things personally.",
            "Neutrals: Artistic, loves animals (specifically cats), homebody who still likes getting out in nature.",
            "I am an overthinker and a planner. I am loyal (to a fault), and love my family more than anything in the universe. I don't make friends easily, but I am flexible and adaptable enough to get along alright with people. If I get to know you well, I will stand by you.",
            "I'm a quiet, anxious person who is very creative and imaginative.",
            "Laid back, relaxed is how most people describe me.",
            "Easy-going to the point of sometimes being a pushover, optimistic, and funny. I've always been able to make people laugh, no matter the social group. For the most, being easy-going has served me well but occasionally I get taken advantage of by people who need it to be done their way.",
            "Don’t take no shit!",
            "My confidence and extroversion for sure.",
            "Bravado, confidence and happiness.",
            "I’m very calm. Especially in high stress scenarios. Also, irrationally protective of my sibling. Like, I know they are a fully grown and highly capable adult... but this is the one member of my family I really wholesale adore. I just want to bubble wrap them and give them everything they’d ever need and keep them safe, you know?",
            "I'm a sassy lil fucker. Hardly ever speechless, but still respects people's opinions and beliefs. I know where boundaries are and haven't crossed any recently.",
            "Honesty/openness and determination",
            "My blunt personality.",
            "I’m extremely reserved, but everyone who meets me seems to love me. I try to smile as much as possible to let people know I’m approachable. To anyone who knows me, I’m the girl who’s always smiling.",
            "Shy, quiet, introvert.",
            "You can use maybe a color, horoscope, a fictional character, or what ever else :) I guess how you answer this could provide extra information on your personality.",
            "Hope you are having a fantastic day/night! Thanks for reading.",
            "If I was a spice, I'd be flour.",
            "Hahahaha that is so fucking funny. You are obviously very clever",
            "A reforming Bojack Horseman with a little bit of BMO.",
            "BMO? I haven't seen that show yet. Still work picking it up?",
            "Oh i love BMO so much",
            "I'm a very social person without a social life, I often go to text people and realize they haven't replied to my last one so I don't bother.",
            "I'm always changing my opinion on stuff, mainly my own balances. For example the balance between how much self satisfaction I need for complete happiness, and how much of that comes from outer influences like relationships and compliments.",
            "Loops of mentally self harming myself with how I interact with others.",
            "As much as I hate the Marilyn Monroe quote and all who use it, I have noticed a large difference between the best I can be and the worst I can be and I don't know how I raise the bar for the worst I can be.",
            "When I have goals I will do anything for them, when I don't I am the laziest human on Earth.",
            "Sounds like you know quite a bit about yourself :) that is really great. How do you think you came to know all this?",
            "color: chartreuse; a yellow-green",
            "i teeter between being anxious (yellow) and chill (green) so much that sometimes the boundary between them blurs together",
            "Sounds like quite the mix to feel. Also that sounds like a very fancy color as far as color fanciness goes.",
            "I don't believe in horoscopes - but the older I get the more Capricorn I get.",
            "First of all, my sign is a sea goat and my favourite activities are swimming by far and rock climbing and yoga. So I got that fish tail and hooves goin on.",
            "Next, my 3 closest/oldest friends are Taurus - which is supposed to be a sign I get along with.",
            "Some of the nice \"Capricorn traits\" I possess: Loyal to the point of being hard to get rid of..., trustworthy, patient unless you suck at driving and are in front of me, practical and ambitious.",
            "Some of the negative traits I possess: Dictatorial, detached/aloof, pessimistic/worry-wart, and stubborn/rigid in some aspects you can do things your way, but my way is the most efficient.",
            "Some traits of a Capricorn I don't think are relevant: Conceited/self centered, unimaginative/boring, conservative.",
            "Very well written :) thank you for sharing. I guess I am a cusp of Libra and Virgo so I have no idea what that means!",
            "P.S- Bourbon.",
            "\"Piece of Work\" by Jimmy Buffett and Toby Keith",
            "Edit: Mostly a joke, but it does hit some particularly precise points.",
            "I haven't heard the song but I get the jest of it :)",
            "Do you like country usually?",
            "if somehow rick sanchez and HR wells had a kid who was then raised by dean winchester - that would be me",
            "Sounds like the best person ever. You win. CLOSE THE POST. hands you medal 🥇",
            "If I had to relate my personality to a remixed-song I would be \"Goofy and Boujee\" or to be more in depth.. a black libra scale",
            "I'm going to level with you.... I didn't understand that at all.",
            "This color + Lil B + a Roland TR-808 drum machine",
            "edit: I'm also brie cheese and a sweet potato",
            "Can you pleas explain? I have no idea how that all meshes together.",
            "a not as snobby \"mr. darcy\" - I tend to appear very serious to people who dont know me, thou I'm really easy-going and witty person! if i'd have to pick a song to describe me it's bee \"here\" by alessia cara: I hate big parties/clubs and l can only handle hanging out with small groups of people (whom i like), but I'm also horrible at saying no, so i always end up in situations/places i don't enjoy being in lol, i'm working on it!",
            "Hahahaha I don't know Mr. Darcy. What is that from?",
            "I'm really matter-of-fact about things, which people say makes me oblivious to some social subtleties (e.g. some people think that I am oblivious to flirting when as far as I'm aware I've never experienced being flirted with).",
            "When I find something that I like I typically get passionate if not very passionate about it. For me my passions are music theory, music composition and politics.",
            "I try to, as much as possible, treat my friends and myself as equals, not in the sense that I don't have some people I'm closer with, but in the sense that I do not consider myself to be \"better\" than anyone else.",
            "Related to the above, I try to provide for others in the same ways that I feel they provide for me, in a kind of symbiotic way. I try to be helpful when I can, and if I have the ability to I will give things to people in need.",
            "I have a weird cognitive dissonance when it comes to my self worth; some times I constantly inwardly berate myself with thoughts being along the lines of \"I should be better\", \"I should be more useful\", \"why can't I be better at X like Y is\", \"Why can't I help the people that I want\". Then other times I don't have these thoughts and feel content with how I am as a person.",
            "I try to be very honest. To be clear, however, I prefer honesty and integrity in intent and result rather than necessarily in communication. For instance, I would prefer to lie to someone about what I was doing or how I feel about something if I know it would either benefit them instead of being a burden upon them, or if it would benefit me without placing any unnecessary burden upon them. As an example, one thing I would do in school from time to time during my study hall was to ask for a pass to the school library to \"study in a more comfortable environment\". While I did study, more often than not I did this so I would be able to interact with my friends who had a class in the library during the same period. Another example would be me exaggerating about how someone could improve something in order for them to consciously think about making the improvement, ultimately doing what I wanted them to achieve rather than my exaggerated version.",
            "Wow, I don't know if you meant to write this as a possible resume for friendship but if so I would hire you.",
            "Fantastic detail and elaboration :)",
            "Empathetic but very introverted. I think that's a fairly rare combination.",
            "I don't think the two are mutually exclusive.",
            "I've know several introverts who are empathetic - hearts of gold really :) They just don't like talking about it :)",
            "A slightly happier Eeyore? Mostly low level depression with mini bursts of pleasant happiness.",
            "Love this description! :)",
            "Nana internet hug",
            "Your Personality Type is The Producer (BICAS)",
            "Producers are emotionally balanced, which means that they are less prone to depression and are able to cope well with feelings of anxiety, anger and vulnerability. Due to their independence and reserve, sometimes the Producer can be perceived as arrogant or unfriendly, however this is merely because they don't require the same level of social stimulation or interaction that others may seek. The Producer generally prefers fact over fiction and security and stability over ambiguity and disorder. Sticking with convention and familiar routines is generally best. With a sense of social responsibility and a general trust in others, Producers are often seen as sincere and generous. However the Producer has a refreshing impulsiveness about them, they tend to dislike too many rules and regulations and can be casual and whimsical.",
            "I never thought of myself in this way but - I think I like it! :)",
            "Reserved.",
            "I'm a neutral-good druid.",
            "A song. Stratovarius - Just Carry On. That's it.",
            "Impatient assholes who really just wanted see the world burn but also be able to see it thrive again in an ideal state of equality",
            "But yeah in a fucking piece of shit who cusses like a sailor and uses dark humor",
            "Yeah, I also have never traveled on the dark web. I have thought about giving weed a go. I live in a state where it is legal! So could you educate me on that?",
            "Adequate.",
            "I would say I'm comfortable alone but easily social. Apart from that, I feel like I'm calm and rational too.",
            "Hmmmm how about some \"bangerz\" I don't really have a library of any good fast pace music for working out or any other ummm intense things I like to do.",
            "BICAS?",
            "I can kinda equate myself to that pistachio in a handful that has a thinner opening on one side to get at. It's possible to open it up with some work and attention to get to the flavorful good stuff, but some people are too busy or superficial to try. That's how I end up with a lot of acquaintances and less real friends",
            "Muddled brain. Stark difference between how I perceive myself to be and how I act.",
            "I've always been a glass-half-full kind of brotha.",
            "Lilac. I like purple and it's a calm color.",
            "Leo, I'm not 100% sure what that means but there's no way I'm a lion. I'm more like a mouse.",
            "Student, musician, reader, introverted, fangirl.",
            "A mix of asshole, hedonist and stoic",
            "I am essentially a cross between a golden retriever and a flying squirrel",
            "I tend to be logical. Sometimes to a fault as a few friends have said. I've made some decisions with love that were logical and I delivered them that way. While I wasn't wrong it wasn't sensitive of the other person involved. That doesn't mean I'm emotionless. In fact I'm quite expressive with how I feel and what I believe in, I just tend to form opinions and base decisions on logic rather than emotion. While generally good this leads to some interpersonal conflicts with more free spirited people but nothing horrible. I'm also extremely ambiverted. Some days I just want to hang out with people and others I don't want to see anyone. It comes and goes. I'm also a huge nerd so if you get me to start talking about something I like I'll never shut up because I get excited talking with people who have the same interests. It takes a bit to draw me out of my shell sometimes and it's easier for some and not others, but if you do I'm generally a good person to have around. Though I'm not perfect and I'm aware of my flaws, I can come across as cold, I can get easily frustrated by the inefficiency of others, I tend to be judgemental when I find others to have view points I find completely counter to mine (though I've gotten better in empathising here I still will maintain them being wrong even if I understand the why, I tend to think it doesn't justify the action they take), I'm an extremely messy person and getting me to clean up is a hard thing to do. There's more but I'm aware of what makes me me and so this allows me to fix or strengthen the traits that are a part of my personality. It's taken me years to get here (between bullying in middle school, awkward at the beginning of high school, and dealing with Seasonal Affective Disorder), but I finally like me as I am now and I hope I'll be a better version of myself later! :D",
            "Sweet, kind, caring and, honest.",
            "Generally awful",
            "Salty",
            "What are you, OP?",
            "Oh shit. A color? Blue",
            "I mean I'm unique. I get a lot of shit for that because \"everyone says they're unique.\" No, fuck that and fuck you. I am unique.",
            "I'm a Unicorn Tigress Ninja Warrior Queen. That's how unique I am.",
            "On the outside I would say I am grey, not much to it. Simple. I like listening to people and being in the background. Then some days I really want to kill that part of me and I itch to get out",
            "I'm very quick to fly off the handle, like Usain Bolt quick under the right circumstances",
            "In an intense battle with myself over my own personality. One half wants to be friendly and happy, the other wants to be alone, and can't find enough of a reason to be happy. So far, it results in a mess that tries to function like an average person, but ends up either constantly making references, or constantly insulting itself through jokes. At least, in front of others. When alone, the \"Can't find enough of a reason to be happy\" side grows quickly.",
            "This also seems to have a side effect of hopeless crushes.",
            "I'm an introvert by day and extrovert at night...when I'm drinking.",
            "Depressed as shit",
            "You mean personalities?",
            "Quite large",
            "Round",
            "Amazing and very wise....if you ask me.",
            "Like a dry sponge",
            "Which one?",
            "Fuck off",
            "Shut up blud",
            "Gregarious, witty, confident, courteous....",
            "But that's just what people see. The inner workings are a lot more complex and not quite so happy and outgoing all the time. Fake it till you make it, you know?",
            "Haunted by introspection, curiosity, and a few insecurities?",
            "My what?",
            "Indifferent.",
            "How does that make you feel?",
            "Quiet and friendly, but once I get to know you well: the guy you go to for advice, but also really funny.",
            "Non conventional, explosive, chameleon-ish, anxious and yearning.",
            "Dry.",
            "Friendly, polite, and eccentric.",
            "Calm, cool, collected",
            "Yin and yang describes my personality perfectly.",
            "Stoic and emotionally distant, which I compensate for by being a loud fratbro with my friends and a quiet wallflower around acquaintances.",
            "It's kind of funny when worlds collide and one person gripes about how I never talk while another jokes that I won't shut up.",
            "Stubborn, friendly, polite, and nerdy.",
            "Me.",
            "Calm and collected or harsh and realistic. Whatever is needed at the time.",
            "monotonous and impulsive",
            "Emotional, \"spiritual\", kind, nerdy, introverted, grumpy, optimistic about certain things, and protective.",
            "A gamma ray burst.",
            "Powerful, energic, and with a nice colorful aura but destroys anything that stays in my path.",
            "Neutral chaos.",
            "Comes in multiples",
            "So you know on facebook you'd see those \"whats the first letter of your name and birth month\" and then assigns words to those. Well that was the day i learnt what callous indifference means and just how eerily accurate it was.",
            "So yeah, callous indifference.",
            "the Meyers-Briggs INTP personality is an almost perfect description of me.",
            "Nice, boring, calm, introverted, nerdy, perfectionist.",
            "Pragmatic.",
            "Also facetious, friendly, crude, helpful. Depends on the audience.",
            "Compassionate but get taken advantage of, changing that slowly. Funny, light hearted and honest. Quite a bit of nihilistic and angey sloooowly changing that. very hard.",
            "Strong (or maybe abrasive to some people); very honest, for better or worse; unpretentious; cool towards people until I get to know them; overall kind but also hot-tempered; and I’d like to think I’m somewhat intelligent and witty, although I’m still pretty insecure and anxious. Tough to outgrow those awkward high school years, even when you’re old.",
            "Want to be kind, want to be good, want to be honest, I struggle to express myself at times and sometimes there is so much clarity when i speak, I am confused as to what i am. I accept that i keep on evolving, I want to be better but in many cases don't know the best path.",
            "Laid back.",
            "Laconic.",
            "Chill.",
            "I don't understand the question.",
            "True neutral.",
            "it's like the weather man.",
            "If you looked up the ISTP description, I fit ~80% of that. If you looked up Gemini, I fit ~90% of that.",
            "Strange when obviously the Meyers Briggs and astrology are both hocus-pocus.",
            "Like raw toast",
            "Loud dickhead but also funny",
            "shy outcast",
            "Friendly, easily hyped, calculating, overly empathetic, cautious and a fucking weeb.",
            "Quiet. Hugs, mainly. I like hugs. Don’t get many",
            "eclectic",
            "Simple, inoffensive, insert beer receive jokes.",
            "Charismatic, extroverted, and a little flirty.",
            "Laid back, chill/weird/",
            "I have the emotional range of a rock, but when I go online I’m a completely different person.",
            "Shy, homebody, into video games, depressed",
            "For me it’s if there are those dog ear and nose filters. Really any heavy filters in general but those feel real juvenile.",
            "Recently years, I have been told that us men should open up, express our emotions and share our feelings.",
            "I have been told that open up is empowering, and that real men do so.",
            "However, from my observation, women will view these type of men as weak, despite what they say about men need to express feelings.",
            "I find a bit from Chris Rock's stand up quite accurate: \"A man is only loved under the condition he provides”",
            "If when a man is struggling, having hardships, do women really accept the weakness coming out of him.",
            "Thoughts?",
            "Edit:",
            "Wow, this is getting a lot of responses.",
            "As I'm 18 and can't really date any lower than my own age I'll give an upper bound. Personally, I would only consider dating under 45. 45+ and its starting to get into grandad territory for me",
            "[removed]",
            "My big ol dick",
            "Introverted, quiet, anxious, awkward, nice, confused",
            "It’s hidden under a lot of masks. I don’t even know what the base one is anymore.",
            "I will spew out the most random things, some that'd make you laugh, some that would weird you out, some that'd do both. And it'd be hard to catch me in one particular mood.",
            "Enneagram 1, ENTJ",
            "Protective, down-to-earth, easy to talk to, open minded, I like to joke around a lot, I don't take life too serious, headstrong, altruistic at heart.",
            "Everyday, I make a point to make at least 1 person smile or laugh. Positivity is something I try to put out into the world",
            "But there's another side of me; I'm very vindictive. When I say you'll pay for doing me wrong, those aren't empty words.",
            "Just don't cross me.",
            "Then again, I believe that's most people honestly.",
            "Soulmate. lol",
            "It changes as the day progresses. Idk why I have to google it",
            "Amogus",
            "Opaque shower door vibes",
            "Moist",
            "Three words:",
            "Hard-working.",
            "Alpha-male.",
            "Jackhammer.",
            "Merciless.",
            "Insatiable.",
            "Thats Five....",
            "Dark, Bloodshed, Insane, Depressed",
            "So... Edgy?",
            "I dont know why I hang out with this guy but I like it",
            "Kind, awkward, shy, well meaning, strong-willed, feminine and inconsistent. I'm working on getting rid of the last one.",
            "Doesn't talk much",
            "Rubbish",
            "Stupid and cynical but out in public I have no personality.",
            "Like absinthe. Not for everyone, I might make you insane, probably ruin your night, but some people like me well enough.",
            "A bit bossy but they know their shit and can help u with your homework",
            "Mine, no one's elses",
            "Asshole",
            "tfw no gf",
            "Boring.",
            "I think r/dorbol explains it well",
            "I don't take myself seriously, but expect other people to take me seriously",
            "Have you seen a corgi and a rabid wolf next to each other?",
            "Which one?",
            "A bouncing bubble of spite and emotions that could easily ruin someones (including myself) day",
            "I can admit when I'm wrong.",
            "Yeah, but that’s because you’re wrong all the time.",
            "One of my best strengths is how encouraging I am.",
            "I've always had a hard time with this, and decided I'd try and fix it. So I started off small. Every time I wasn't too sure about something I would lead with \"I might be wrong, but...\" or \"This could be wrong, but...\"",
            "Then when I was comfortable with that, I started saying \"You're right...\" when people confronted me about things that were wrong.",
            "Now, I am more comfortable with saying \"You're right, I was wrong about...\" than I was before. It's relieving to not have to come up with an excuse, and to just admit it. It helps your ability to realize your mistakes and improve upon them.",
            "I think I could probably admit if I was wrong but I don't know since that's never happened.",
            "Same here. It's really a double-edged sword, from my experience anyways. You either get a \"oh, wow, I wasn't expecting you to admit that\" or a \"hah, damn right you were wrong, dumbass!\"",
            "That's a quality I wish more of my bosses have had over the years. What people don't realize is that if you always shift blame to someone else so it looks like nothing is ever your fault, it won't make people think you're perfect. Instead, everyone will remember a time when you blamed them for something that was totally your fault, and think you're an asshole.",
            "It takes a lot for me to 'snap'. I don't go looking for fights or reasons to be offended. I forgive a lot because I see no reason to hold a grudge, if I don't like someone or they break my trust then I simply distance myself.",
            "Also I am not a dick about it.",
            "I'm the exact same.",
            "I feel like there's no need to grow hatred towards someone, unless there's a really good reason to. For most people, I see through their faults and see the good in them. There's always two sides to any situation, so why not view it in the most optimistic way?",
            "I'm persistent (as in I don't give up very easily). Interestingly my worst trait would be that I can be stubborn.",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"No\"",
            "\"Will you go out with me?\"",
            "\"JESUS FUCKING CHRIST, OKAY. WHEN ARE WE GOING ON THIS DAMN DATE?\"",
            "works every time.",
            "Well, I've heard that it's a key to success. Good luck with that!",
            "As am I, but the word persistent has a negative condemnation to it. I prefer to say I'm perseverant.",
            "persistence will get you further in life than ANY other trait. seriously. your future is bright.",
            "Reliability.",
            "I never miss work, always show up on time and I'll always put my full effort into finishing a job. I've gotten a lot of compliments on it, although after being called dependable or reliable all of my life, I think I might just be really bland.",
            "The world needs more reliable people",
            "I have this. But only if I'm getting paid, apparently.",
            "Ask for a raise. Don't think that they will notice and out of appreciation just offer you one.",
            "I know what you mean.",
            "People laugh at the guy who messes up all the time, and they get annoyed about the guy who lets them down at the last minute, but they don't really think about the person who just does what is expected. This type of person hasn't got a querk. They are just \"there\".",
            "It's like when someone describes you as \"nice\", just because you haven't done anything noteworthy - good or bad. I'd prefer to be a jerk, but I don't have it in me.",
            "That's a great quality to have and something that will hopefully allow you to move up the ladder faster than others.",
            "I'm the most humble person on the planet, like seriously number one for humility.",
            "\"I'm just a humble motherfucker with a big-ass dick.\"",
            "I've been called modest before. I'm really an arrogant motherfucker who just knows he overestimates himself.",
            "For some reason the way this is worded reminds me of Archer",
            "I'm a great guy. Just ask me and I'll tell you.",
            "Ha, earthling. I'm the most humble person in all of cosmos.",
            "I treat everyone as a person. No one is below me, no matter their position in life.",
            "even woodhouse?",
            "The layout of reddit threads makes that statement a bit ironic.",
            "I'm never in a bad mood, or for very long when i rarely am.. I don't see the point in being down, or upset, especially by other humans and their silly circumstance.",
            "People seem to like me because I am polite and I am rarely late. I like to eat ice cream and I really enjoy a nice pair of slacks",
            "Compassion. At least that's what my friends tell me. I'm always the go-to person if they need to vent or discuss something.",
            "As someone who listens to a bunch of people vent it gets annoying sometimes when it's over the same stuff.",
            "Does that ever get frustrating? I'm down to listen to my friends vent and what not, but I feel if I was the one the whole group goes to and that was what I was primarily doing when hanging out with them it would be a bit depressing after awhile",
            "I'm very punctual. That's something, right?",
            "Good for you! In parts of Africa, their \"culture\" is to be late to everything. So what you think, 15 mins late? I'll just be 15 mins late too. But this was 2 - 3 hours late to everything. Starting ceremonies, meetings, work, this late, just makes it impossible for a society to get things done. I'd try to be late too, but I always got there a little late and then waited. It drove me nuts.",
            "1,500,000 comment karma",
            "Yup, you seem to be very punctual!",
            "I wish everyone had this trait",
            "By most accounts you're actually pretty early.",
            "Ejaculate! Now!",
            "You're also very stickley, so you've got that going for you.",
            "I know when to stfu when I don't Know what I'm talking about/ my opinion isn't wanted or needed.",
            "You didn't know this time.",
            "I got reddit gold twice in my first three months on reddit..so i got that goin for me which is nice",
            "Edit: Hat trick, thank you kind stranger",
            "And the rich get richer. :(",
            "What is this...",
            "You must be one funny motherfucker.",
            "How...?",
            "Nice work. I've been here nearly a year and have yet to get gold. I just like seeing the star next to the comment.",
            "jealousy... guess that is not my best characteristic.",
            "What a gold digger.",
            "Is this the beginning of the gold train?",
            "Someone who knows how to have a conversation and isn't glued to their Goddamn phone all day.",
            "I'm great with children.",
            "I'm very, very kind. I do thoughtful things for people I care about often. Examples include: Now that I'm out of college and have a job, I usually take my parents/grandparents/etc etc out for dinner when they come visit, when I go to friend's houses I usually bring a snack or something for us to do together, I will give pretty much anyone a backrub/hug if it will make them feel better. I also give really honest advice rather than what I think the person would like to hear.",
            "I also look for the best qualities in anyone I meet and appreciate those even if I don't particularly want to be close or like the person. I don't hate anyone for being gay, if they like to party all the time, any life choices they make, etc. I am very good at accepting people for who they are and not judging.",
            "I have also been told that I give perfect gifts for Christmas/birthdays which is due to the thoughtfulness.",
            "This is all based on things other people have told me, I think I'm pretty average.",
            "Edit: I'm also very dependable, if I say something I will absolutely do it.",
            "You sound like an amazing person.",
            "I am nice.",
            "Sometimes I'm too nice.",
            "Im not a racist, I just treat everyone like white people.",
            "My sense of humour. I practically talk in puns.",
            "I looked really hard for the pun in there, and i'm afraid i'm a little dissapointed :(",
            "To most people you know, that is your most tolerably obnoxious trait.",
            "I'm extremely calm and laid back. It is really handy because I can handle tough situations well. Not handy because I'm not motivated by pressure really.",
            "My sense of humor.",
            "No one ever wants to hear my dead babie jokes!",
            "I'm pretty laid back and usually approach situations practically/logically.",
            "It sounds like you're a dude.",
            "Optimism. PS your awesome",
            "Thanks for sharing your optimism : )",
            "Pretty sure I don't have one. I like to think I do, and come up with nice things to do for people when they aren't around, but when they are actually present, I treat them horribly. I'm a horrible person with good intentions. I think.",
            "Hey, good intentions already make you a good person. Just be confident",
            "I can laugh at my mistakes",
            "I've been told I have nothing in common with Kanye West",
            "I'm the kind of guy that will put a smile on your face, but more importantly, I'll be there when you need me the most. It doesn't matter what hour of the night, or if I'm in the middle of a magic carpet ride.",
            "Aww : )",
            "I'm an asshole, but I'm a funny asshole",
            "Said every asshole ever.",
            "I'm sincere. It's what I like about other people the most. I think what I say and say what I think.",
            "Me too. Hand in hand with honesty. I am what I am",
            "I'm good enough, I'm smart enough, and doggone it, people like me!",
            "Apart from me being too humble, I am perfect.",
            "I'm very charismatic - charming, witty, humorous, eloquent, gracious when needed, etc.",
            "Generosity",
            "I'm fucking awesome and damn modest too.",
            "My real answer (not that i'm saying i'm NOT awesome) would have to be that i'm friendly. This might be a by-product of some other traits, but i make friends so easily, and whenever a friend group of mine has a political spat and divides (has happened more than i'd like) i still manage to stay friends with both sides.",
            "I have a knack for making people laugh at the stupid shit I say. I'm not legitimately funny, but I think my ability to smile and make people feel at ease around me makes it easy for people to laugh, even when my jokes are terrible.",
            "I have a lot of common sense and I USE it.",
            "A great idea!",
            "My Amazing Modesty",
            "I never pretend to know something that I don't have a firm grasp on and I'm not afraid to ask seemingly stupid questions.",
            "I get laughed at sometimes but I'm never the one making a stupid mistake because I was too proud to ask about it.",
            "I am very empathetic, and have an excellent ability to understand and appreciate different points of view.",
            "I know how to shut-up when it's 1) not my turn 2) I'm finished with the thought.",
            "Honesty/being straightforward.",
            "A lot of people don't like it. Especially when they avoid the question and focus on something other than what the issue is.",
            "I'm usually very confident and undoubtedly loyal.",
            "I'm extremely analytical. This helps me be calm in distressing circumstances and think things through.",
            "I'm patient and flexible.",
            "I finish everything I start.",
            "I've come to find that i'm always nice and friendly to anyone and EVERYONE i meet and i will continue to be nice to them unless they give me a reason not to. even if they are annoying or a little... off. ive found its just better to be nice and friendly.",
            "I've been told I'm very approachable. When I'm out, I can be alone, but always find someone to hang out with.",
            "I am for sure the most humble person I know.",
            "I piss out my butt.",
            "I am so fucking well spoken.",
            "My ability to come up with witty... Stuff",
            "I don't get angry/yell-y. I get upset like everyone else, but I don't let myself get raged.",
            "I don't fart in confined spaces. You're welcome.",
            "My best traits are anyone i meet i want to consider a friend and leave no out and treat everyone equally.",
            "I feel so worthless that since I don't think I deserve you I will treat you better than anyone. I'm also depressed so I don't mind staying in bed cuddling the entire day since I probably wouldn't be able to get out of it anyway.",
            "How humble I am.",
            "Infact, I am the most humble person I know.",
            "My humble attitude and even though at my young age i am already so successful, i still am down to earth and always modest.",
            "Justin Bieber?",
            "I am a really good listener",
            "Me too, but maybe that's just because I'm usually not much of a talker.",
            "This is a rare one these days. Don't lose it!",
            "I'm sorry you're going to have to speak up a little bit louder I'm hard of hearing.",
            "Having very keen foresight.",
            "thought this said foreskin",
            "I'm quite but pretty friendly.",
            "I walk the very fine line between carefree and careless. It is also my worst trait, coincidentally.",
            "I stay true to myself.",
            "I am in fact one chill guy that would do literally everything for his girl in question. (Backfired quite a few times but i just don't want to be an asshole :( )",
            "Sometimes, I can almost take care of myself :D",
            "Mine? Well,",
            "I'm a daydreamer.",
            "How is this good? This is not meant to be an offensive question, I'm just curious",
            "Im going to tell you how i really feel about you good or bad, if you are an asshole to me constantly im going to let you know with words not with fists",
            "Honest. Feel that as long as you're honest things will always workout and people respect that.",
            "Yup, I agree!",
            "I'm deaf. WHAT?! I DIDN'T HEAR YOU!",
            "Speaking for like a 70 % percent of people who answered here",
            "\"I'm humble\"",
            "I am persistent but not stubborn.",
            "I have a fake plaque in my office from my team that says \"Sam Ryan, CPO\" and under it is Chief Persistence Officer.",
            "I'm too polite... Unlike the rest of you dicks.",
            "I'm goofy. I like to laugh and joke and act like a lady child sometimes. I can be serious and definitely know when to be. There was a point where I was too serious but I've learned to let that go to an extent which has helped me breeze through these past few years of life. I wouldn't change it for anything!",
            "I'm pretty much always thankful.... & a state of constant gratitude is one of love and happiness. 10/10 would recommend.",
            "My best is also my worst I think. I am fiercely protective of my friends/girlfriend",
            "If someone tries to hurt them or is rude to them I'll jump in before I realize what's happening.",
            "Sometimes it comes off as a bit overprotective. I can only imagine why.",
            "Holy hell, I can't think of one. That's depressing",
            "Patience",
            "I'm persistant and stubborn, I also always try to help people even if I know that deep down I don't care about most of them apart from a few close persons",
            "My sense of humor. Not being afraid to make stupid faces at people. Especially on the interstate.",
            "I am giving and forgiving almost to a fault. I'll usually do any favor for a close friend and not complain about it. It's probably some underlying issue about me needing people to like me, but I'm sure people appreciate it.",
            "I am always calm and collected. I don't show anger or anxiety.",
            "Work ethic. I can't stand just lying around with extra work to do.",
            "I'm trustworthy, introspective, honest and loyal.",
            "I get taken advantage of a lot. I've lost a few friends for putting a foot down. But I guess the friendships weren't that great to begin with.",
            "I have been told I am genuine friend.",
            "I'm loyal, almost to a fault. Even if you give me a reason to betray you, I won't. I may stop talking to you, but anything you told me in confidence will stay a secret*. I also don't let the shit going on in my own life keep me from being there for a friend.",
            "*this does not apply to things that are both illegal and immoral, like murder. Truly victim-less crimes however are fine.",
            "If someone asks me a question, I will tell them the truth, consequences be damned.",
            "This is also my worst personality trait.",
            "I have learned to start prefacing some answers with, \"Are you sure you want me to answer that?\" People who know me well sometimes say no, after giving it some thought. Being my friend is a fast way to learn that some things are kept hidden from you for your own good.",
            "Bizarrely, people also tend to entrust me with sensitive information, which enables me to cause more damage with my stubborn honesty. I'm good at keeping secrets in the sense that I won't go around blabbing, but I refuse to lie on someone else's behalf.",
            "Short list of exceptions: Happy surprises like surprise parties. If I think it would be better for some news or information to be given by another party, I'll say \"Talk to Soandso about that.\"",
            "I have come to believe over the years that there are things you don't want to know. But I also still believe that if a person really wants the truth, they are entitled to it.",
            "I can laugh at myself. I see too many people that can dish it out but can't take it. I've always thought that it's ok to poke fun at myself or laugh when someone else does. Quit taking yourself too seriously, people.",
            "I am laid back; I'm really hard to offend.",
            "Conversely, I get really annoyed when people get offended about most things.",
            "My humour, I like to laugh and make others laugh. I'm really good at mingling because of it. It's not rare to see me crying with laughter, my work colleagues are worried for me.",
            "Hmm.... This is a hard one. Good traits: I'm honest( sometimes a little too honest ). I am very persistent in everything I do, and don't like to give up on something or someone. I'm loyal and try to respect the people that deserve it.",
            "Bad traits: I find it hard to keep my emotions in check. ( mostly anger issues ) I am very misanthropic ( this due to a crazy childhood which made it hard for me to see the good in people in general ) I'm almost always depressed which can probably be a downer for others in some situations. I'm forgetful about small things ( this can piss people/girlfriend off ) I'm not calm at all and work on people nerves ( ADHD + messed up childhood might have contributed to that )",
            "The bad don't really outweigh the good, but there you go.",
            "I like to think I'm very honest.",
            "I don't mind. I really just don't give a fuck. I know some people find it annoying but at least I'm easy to get along with.",
            "I pick up the slack when other people are going through tough shit, and have always been willing to do that. Kind of sucks because it makes me less willing to talk about what's bothering me, for fear of being a burden.",
            "I'm a pretty nice person, or at least I would say I am",
            "I used to be able to see an argument or dispute from everyone's point of view and often be able to calm the person I thought was in the wrong and show them in a nice way that maybe they shouldn't have done whatever they did. Unfortunately my friend's constant bitchiness and bitterness has rubbed off on me. Now if I see an argument boiling up I either become sarcastic as fuck or just play on my phone or find something else to do.",
            "I'm not a total cunt IRL. I still have my moments though.",
            "I'm a bit of a cunt on Reddit though.",
            "I see the good in everyone.",
            "Everybody's intellectual intelligence is far less superior than my own",
            "I'm actually really easy to talk to and therefore empathetic according to people. I'm also considered a great friend.",
            "I don't get upset. I can see when I'm wrong and admit it. I forgive quickly. With my SO I have taken her side and argued against myself.",
            "I'm blunt. I will tell you straight up if I like you or not, and often compliment something you have",
            "Often people come to me to see the truth in things because I don't sugar coat things.",
            "I'm a reasonable person. There is almost nothing you can tell me that I won't give considerable thought to before I form an opinion, and if you can give me any solid evidence/reason for me to believe my opinion/belief is wrong then I have no problem admitting that.",
            "I'm pretty laid back, maybe even a door mat in some people's opinion, but I prefer making an annoying situation work for me rather than bitch at someone else. I just prefer not getting angry, it never feels good and can even make it worse.",
            "I'm really good at making people laugh, even when they don't want to.",
            "Whenever people are sad or they look like they could use cheering up, I find a way to make them laugh. Whether it's at me or with me, I get a laugh. If I can make people forget about whatever it is that has them down for even a few seconds, sometimes that's enough to make people see that things will get better.",
            "My grandmother died in November. I went back home for the funeral and saw some people that I haven't seen in years. I spent the weekend keeping smiles on everyone's faces because it felt like they needed it. I was worried that someone would think that I didn't love my grandmother, or that I was being disrespectful, but no one said anything like that. A couple of people even thanked me for lightening the mood.",
            "My mother used to get mad at me for \"Not taking things seriously enough\" (some on, who says that to an 11 year old kid?) and now she likes to tell everyone how funny I am. Interesting how that worked out.",
            "I don't tell people about my depression because no one would believe me. I'm the funny one. I'm always smiling and making everyone laugh. I know how Pagliacci the Clown feels.",
            "Low light? No problem.",
            "Some of the best times happen when the sun’s down. Capture the night with crystal-clear, bright pics and videos, no matter the lighting with Nightography. Nightography lets you snap or record every single moment clearly, regardless of light. Galaxy S22 and S22+ also feature an incredible all-day battery that can power through a night of endless adventures. What will your epic moment be? The possibilities are limitless.",
            "www.samsung.com/us/smartphones/galaxy-s22/",
            "An inherent sense of self-loathing. Fighting against it every day uses a substantial amount of my mental processing power.",
            "Same here. I feel like I would be a much more accomplished person if I actually believed in myself.",
            "Dude I hear ya. It’s not a constant thing for me, but every now and then I have this circular thought that goes like this; goddamn it I hate myself. I hate that I hate myself. And the loop just snowballs from there.",
            "Oh fucking hell me too. I can’t look in the mirror without getting this rush of hatred towards myself haha. sorry this sounds pretentious",
            "Yeah, don't tell your kids that they are completely incompetent and instead work through their weaknesses with them in a way that makes them feel good about themselves and leads to productive self-improvement.",
            "Or else you get people like the main commenter and like me.",
            "I have this and I also feel that any help I do for myself is inherently narcissistic because I’m too lazy to help others.",
            "Caring what people think too much",
            "The trick that helped me is to remember people have enough going on in their lives. The lady at the shops might notice me walk past with a sauce stain down my shirt and think I'm a grub for a second or two but then go back to thinking about her meeting tomorrow and what she wants for dinner.",
            "Arrogance in spite of mediocrity.",
            "How dare you make me realise this about myself.",
            "Yeah, this.",
            "I find myself valuing my skills and my knowledge higher than it should be and I really struggle to bring myself back down to a more realistic level.",
            "Mediocrity? Aim for less",
            "Are you my former SO?",
            "This is the one thing I hated the most. She had an absolutely massive ego, and, no basis for it.",
            "That's just confidence",
            "Arrogance in spite of mediocrity? Or arrogance because of mediocrity?",
            "haha lol",
            "Procrastination (ruined my life)",
            "It took me 2hrs to reply to this comment",
            "I saw this comment and put down my phone to get back to study, realising I procrastinate way too much. Then picked it back up to make this comment to let you know I too procrastinate. Goodbye now.",
            "What happend?",
            "I'm really quiet, mostly due to social anxiety. I get misconceived as a rude and angry person who hates everyone and doesn't want to be bothered but that actually couldn't be further from the truth.",
            "I hate when people assume that without actually trying to engage that person. Maybe they want to have a conversation but just dont want to start it.",
            "Yeah people tell me frequently that when they first meet me they think I’m a snob. When I first learned this my feelings were so hurt. It doesn’t bother me so much anymore. Let them think what they think. Maybe I am a snob, oh well what can I even do?",
            "Sometimes I do something bad to someone, and I end up ghosting them because I can't deal with the guilt. So I guess, I hold grudges against myself.",
            "The guilt and shame you impose on your self is probably worse than what the people you've wronged would impose. You are also denying yourself the opportunity for redemption, growth, and change. Try apologizing, it may not be easy but it's worth it.",
            "Me:*Pulls out card that says “I over prepare”",
            "This is brilliant! I can see this answer work well in a job interview lol",
            "Inability to give more than zero fucks about pretty much anything",
            "Same.",
            "I'm too caring. I sacrifice all of my happiness to make others happy, to the point that I'm so miserable and turn into a cunt with no emotional control.",
            "Something I'm working on tho.",
            "I used to do that when I was younger then a flip basically switch then I just turned into an ass hole...",
            "It's interesting to see people with the same feelings. But with the size of the population I guess it's inevitable.",
            "Oof this describes me perfectly.",
            "depressions up there",
            "That’s not your personality. Do not feel bad about that shite.",
            "Whenever I get anxious or angry I basically shutdown. I don't deal with either well.",
            "Same. My partner always interprets this badly. It causes so many rows. When I'm angry or upset I just cannot function.",
            "I just do the leg thing more and more rigorously especially if I’m anxious. If I don’t do this, I bite the inside of my mouth until it’s bleeding which isn’t great haha",
            "I'm lazy.",
            "Yup, can relate",
            "Laziness, hubris, and entitlement.",
            "Just finished uni and upon applying for jobs I have realised that these traits got me grades in school but I haven't really learned anything.",
            "Extreme perfectionism in the face of mediocrity which is exacerbated by self loathing and a feeling of inadequacy.",
            "Basically, I hate myself because I’m not perfect but I’m not smart enough to be perfect.",
            "Aggression",
            "Nice try recruiter! It’s still my perfectionism.",
            "Being okay with the way things are despite knowing better",
            "Impatient aS FUCK",
            "Toxicity",
            "Of our city. Of our ciiiittyy",
            "I’m not really sure what my worst personality trait might be. But I did one time drunkenly punch out the headlight of a VW bus outside a Portland strip club. So,",
            "I’m super judgemental",
            "Overthinking",
            "I sometimes let myself get away with not doing things I shouldn’t get away with because of mental health issues.",
            "Like I’m bipolar and I have chronic insomnia and energy issues and am super forgetful, but I’m also really lazy. Sometimes I let myself be too lazy, I think.",
            "I'm essentially clinically incapable of motivating myself to do anything that requires effort for my own sake. If it affects someone else, I'm there right away. If it's for my own sake, no chance until my actual life is endangered.",
            "Victimhood. I feel like I'm always hard done by even when there are many who'd kill to be in a similar position",
            "I find it hard to let go.",
            "There's a movie called Frozen you might enjoy",
            "Narcissism",
            "me too",
            "A social chameleon, or at least my friends tell me I am",
            "I feel this. I maintain my values no matter what but change to fit the people around me. Sometimes I fear that I lack an individual social identity.",
            "Cuntism.",
            "I am extremely humble.",
            "Lol",
            "Trying to please other people.",
            "Thinking I'm worthless while somehow thinking I'm better than everyone else",
            "I constantly need to correct people.",
            "especially on stupid shit. for example I was at my wifes company xmas party last week and her coworker said something about not feeding gremlins after midnight.",
            "its mogwais you dont feed after midnight. that's what made them change to gremlins. and I had to call her out on that. why??",
            "My anxiety.",
            "anxiety/constant need for affirmation and reassurance",
            "The Conplainer",
            "Narcissistic",
            "Not giving a fuck.",
            "Can't help but smile while saying anything cause I'm a nervous wreck all the time. People think I'm an asshole because I smile when responding to something bad and I'm often inappropriately positive. It'll be something like:",
            "Yesterday my cat died.",
            "\"Hahaha awww I'm so sorry to hear that hahaha\"",
            "Expecting/thinking the worst of people",
            "I’m either incredibly cynical, or massively annoying. There is no middle ground",
            "I expect people to do things the way I want them done and to my high standard without mentioning it",
            "My temper. I either learned it from my father or it was passed down. I have gone to great lengths to understand and control it but it sometimes gets the best of me. I often will be mad and sit there and think to myself, why the hell are mad?",
            "I get very angry very easily. It will give me a heart attack one day and kill me I know it",
            "Lack of motivation to change things about myself that I know are glaring problems",
            "I have the same issue. It's hard to change your habits, but if you are honest with yourself, it's easy to recognize all the things you need to change. I think it's still better to at least be self aware.",
            "Sometimes I offend people while trying to be funny and I really don't mean to or really see what I did wrong",
            "Indecisiveness. Sometimes I feel like Chidi is my spirit animal...",
            "For me it's probably being miserable all the time to the point that I bring other people down despite their efforts to help me. I've recently learned not to tell other people how unhappy I am, because the more they are invested in my improvement, the more they will be disappointed.",
            "Laziness",
            "I want to get things done my way.",
            "No confidence",
            "Avoidance of conflict",
            "Warming up to people. At work I'm pretty much ignoring everybody. Even co-workers I've talked to pretty often. Idk why, I just feel reserved and uninterested towards pretty much anybody.",
            "Laziness. Also procrastination .",
            "My inability to connect with reality at times.",
            "Im annoyingly hyperactive when in a good mood, slow and irritable when in a bad mood. Alcohol doesent help",
            "unconscious grandiosity",
            "Lack of patience (which I'm trying to work on, but still rears its ugly head)",
            "Being too logical with things/not being emotional enough.",
            "Same, I don't consider that a bad thing though. I can see how others could get annoyed by that, but whatever, I get annoyed by some when they're being too emotional haha",
            "I tend to say things without thinking... a lot. That, and I’m stubborn.",
            "OVERTHINKING. And taking everything personally. Someone looks away when I walk in the room? They clearly hate me and everything I stand for",
            "I have this problem too. I also feel like when someone texts me and adds a period at the end I get scared because I think they’re mad at me",
            "I'm trying to break this mindset but I find everything annoying. Extra noises, people talking excessively, people in my way. I am trying to work on thinking- this person isn't trying to be annoying, they're just having fun and doing what makes them comfortable. Sometimes I remember before it's too late. It's like I'm only happy when I'm alone in my own world. I don't want to be an old lonely grump though.",
            "Anxious, which means I can talk too much for the sake of it.",
            "Sarcasm... I use it to get points across but, dayum... I make people's freaking eye twitch like they're trying not to stab me",
            "I get angry at the drop of a hat. I hide it most of the time, but I wish little things didn’t set me off as often as they do.",
            "I fear commitment in a relationship. If it is work related, I have zero issues. I can fully commit to a long term project and complete it. Change that project into a person and I cant last more than a couple weeks.",
            "My temper is explosive.",
            "Trying to be always right",
            "I get very angry very easily.",
            "I’m honest about being dishonest.",
            "Sarcasm, and walking tall.",
            "Homophobia (I'm gay)",
            "Jealousy",
            "Greediness.",
            "Competitive. In a bad way.",
            "Giving too many fucks",
            "Depression and",
            "I'm competitive in an almost pathological way. I'm competing against you even if we aren't competing in something.",
            "I'm not a terrible loser most times but I will obsess over it for hours.",
            "so are you the one who's gotta be the fastest when the light turns green?",
            "Pessimism.",
            "I drink far too much when I am around other people.",
            "Leaving shit at 85-95% finished.",
            "I don't know how to handle stress",
            "Im really forgetful about random stuf. My memory recollection also sucks. Just a few weeks ago I couldn't name my gf's brother. Not because I didn't know, but because I couldn't recall it.",
            "I can be arrogant and basically a asshole without even noticing. Thanks God I've noticed it and now I'm working on it.",
            "hanging out for afuck",
            "annoyingly dumb",
            "I'm a pervert.. I'm intellectually arrogant even though I'm not actually that smart. I dislike most people.",
            "I’m a total push over. It’s resulted in my being taken advantage of a lot. ExMIL took advantage of me with my first kid, people try and get free childcare, even in my sex life ive gone home with guys I didn’t want to because of a little pressure.",
            "Basically zero confidence in myself and as a result almost no confidence in others as well. No self esteem and trust issues puts a good damper on relationships I have except with my one good friend who is the same way.",
            "I pretend to like people but secretly don’t.",
            "I feel self concours pretty much all the time and believe that most ppl could not give a shit about me.",
            "My husband is awesome and has helped me build on this - a lot of it was down to an ex.",
            "I lack sympathy for alot of things",
            "Messy. I don't mind cleaning most of the time. I just NEVER ever ever ever put things back where I got them. I hate this about myself but I guess I'm on autopilot all the time because I can't stop.",
            "My boyfriend’s backseat of his car is basically his trash can when he’s on the go. It’s not awesome.",
            "Not having the courage to talk to the person of interest.",
            "Being anxious of what i look like in others eyes",
            "I'm incredibly risk averse due to a large, very fragile ego.",
            "I have a guilt complex",
            "Lack of ability to care about my well being.",
            "I take everything, including myself, way too seriously.",
            "Awkwardness, sometimes I try to be awkward sometimes it just happens.",
            "Everything on the menu is not quite right, I have to make a combination of my own.",
            "If you all go left, I'm going right.",
            "Vindictiveness, I derive malicious gratification from enacting revenge for every perceived affront which is punctuated by interludes of remorse and self-recrimination because I didn't just reciprocate, my revenge wasn't commensurate with what happened to me. The compulsion for retribution has lead me to do some contemptible things without compunction until much later when I've seen the consequences; a lack of prudence is another terrible trait.",
            "Frequent uses of baroque language to alleviate boredom and stress too.",
            "I sweat too much over the little things. Recently, I cried because I got an 89.25% B in a class and I was so mad at myself for not doing better and not getting those 5 points to bring me up to an A.",
            "saying insane things to get reactions out of people, so i like to instigate trouble purely out of boredom or some desire for attention",
            "I can't handle rejection. If someone doesn't appear to like me (in friendships or what not), I will automatically assume myself to be condemned to a life of solitude, and experience pure wrath concerning the person in question. In the past this had led to say some really cruel things to people.",
            "However, I am young so their still time to change this thought process. I just don't know how.",
            "Being a sociopath",
            "Procrastination out of fear",
            "Wanting everyone to leave me alone and needlessly getting angry when they don't, and then feeling lonely when they do",
            "oversharing",
            "Oh my anger issues for sure, sometimes I'm completely apethetic and I can snap at the drop of a hat. I've really tried to work on it and it is no where near as bad as it previously was but still, it surfaces every now and then.",
            "I the worst at keeping s friendship alive. On top of that I’m a bad texter too",
            "Being too nice",
            "I'm too empathetic. I constantly put myself in that person's shoes to feel how they're feeling.\nPeople come to me all the time to vent or for advice and I cannot seem to just listen. No, I have to feel their feelings as well. Reading the news and seeing bad things happen to people, I will directly put myself in that situation so I can relate with all the emotions. It's exhausting and damn depressing at times.",
            "Inconsistency. But at least I'm consistent at it.",
            "A combination of shortish temper and stubborness",
            "Jealousy, and isolating myself from others.",
            "I'm not terribly brave. Sounds so much nicer than calling myself a coward.",
            "I’m often super indecisive about inconsequential things, but then I’m very instinctual when it comes to life-altering things. I’d say it’s actually worked out so far for the most part. But that in no way means it always will, and I could really screw up because of it someday.",
            "I half ass everything I do... even when it comes to schooling. I also have no passions, like I like drawing, but I’m not passionate about it :/",
            "I consider myself to superior to all other people whilst simultaneously hating myself.",
            "I don't like people",
            "I’m crass. I use it as a way to make people laugh. I hate this about myself because for the most part I want to be a person people think of as a good fun guy, not the creep with a dirty mind. I try hard to be the funny pg13 and occasional R jokes but more often than not I jump straight to NC17 and that’s all people can think of me.",
            "I'm overly sceptical about almost everything",
            "I never finish projects after I",
            "Tendency towards paranoia. Like if my boss is a little bit quiet that day, my first thought is that he must hate me and I'm going to get fired, not that he's probably exhausted and preoccupied and it has nothing to do with me. I mostly keep it in check as of late but this trait has definitely been self-fulfilling in the past.",
            "When I go to an interview and they ask this I say Tenacity, it's not too bad. Just positive stubbornness.",
            "In actual fact I am extremely Vindictive when pissed off. It does take a lot to make me angry so most people have never seen this directed at them.",
            "My friends don't like me anymore because all I talk about is Chef Boyardee.",
            "I get too impatient sometimes.",
            "Procrastination, letting good memories with someone keep me from cutting them away, forgiving too easily sometimes,",
            "Fuck off.",
            "I hold grudges (sometimes over small things) for long periods of time",
            "Worrying too much.",
            "I have an obsession with time. I count seconds in my life. 42 min to work, 4 to get gas. 2 min to get situated. Everything in my life is like this. It drives my wife crazy. On the plus side, I work as a scheduling manager, I'm very good at my job.",
            "it's two-fold. I have a lack of patience for things that matter (like my kids, finances, etc) and too much dedication to things that don't matter (video games, reddit, blah blah...).",
            "Well yea, but kids smell bad so why bother.",
            "Apathy",
            "Fry: Now here's a party I can get excited about. Sign me up!",
            "Voter Apathy Party Man: Sorry, not with that attitude.",
            "Fry: Okay then, screw it.",
            "Voter Apathy Party Man: Welcome aboard, brother!",
            "Fry: All right!",
            "Voter Apathy Party Man: You're out.",
            "Me too. It is probably some form of depression. I'd get checked out, but fuck it.",
            "Eh, fuck it.",
            "This is mine. Manifests as procrastination a lot of the time, but the root is apathy.",
            "Passivity and avoiding conflict. I've gotten a bit better over many years but still kinda suck at it.",
            "I'm curious - why do you think that avoiding conflict a bad thing?",
            "I avoid conflict because I hate violence. I don't like hurting people, but I have a sharp tongue and pretty solid fists. To keep myself from hurting people I avoid conflict.",
            "Stubbornness. If someone asks me to do something, I'm usually all too happy to go out of my way to do it even if it's a bit inconvenient.",
            "If someone tells me to do something, it's not happening.",
            "I never noticed that I did this until my husband brought it up jokingly at a family dinner and my entire family brought up various stories...turns out my Dad does the same thing.",
            "I can relate to it. It's because I believe in something like - I am doing it because I want to not because some one told me to do it.",
            "That sounds like a mix of things-stubbornness, but only once you've committed.",
            "Otherwise, it simply sounds contrarian.",
            "Pedantic, I know, but hey-I gotta make a livin'.",
            "I crave validation and reassurance.",
            "well done",
            "You are a wonderful, chestnut-haired sunfish and I am proud of you.",
            "That's a great example, I also have this problem.",
            "Being shy/borderline social anxiety",
            "Dude...I just bonked an interview, right? The anxiety afterwards was so intense, I've been riding the train back and forth for an hour now because I can't catch my stop.",
            "Edit: I got off at the right stop. : )",
            "I get bored easily.",
            "i worked construction back in the 50's and me and the guys would say \"i have board (as opposed to \"wood\" since we worked with a lot of boards and \"wood\" is grossly ambiguous in that industry. we were funny)\" every time a foxy lady would pass by on the streets.",
            "let's just say that there was a lot of eye candy and i got board easily too.",
            "I can be very judgmental and hot-tempered. I don't mean to be and I hate it. It's just a sort of automatic reaction I have to certain things. As I've gotten older I've gotten more self-control, but I still struggle with it on occasion.",
            "Same with me, not so much as the \"judgemental\" but I do get hot tempered too easy.",
            "Like when someone comes to my door at 8pm to sell me something, I'll be the biggest dick because it's inconveniencing me however it's really not that big a deal and every time after they leave I go \"did I have to be that much of a dick about it?\"",
            "Same here. It's a bad trait that you have.",
            "Detatchment. It's easy for me to trivialize things I don't really think much about.",
            "Obsessive about bad things",
            "Anxiety. Sometimes I have trouble letting go of self depreciating thoughts.",
            "Laziness. I want to elaborate more but",
            "lazy",
            "I get attached easily to woman and i tend to fall hard when it ends.",
            "Overthinking/analyzing everything and insecurity combined to make a mess out of me. My mother in law didn't give me a hug goodbye but did to my sister in law = she hates me. My husband didn't sit next to me when we were all hanging out = something is wrong and he's mad at me.",
            "Jealousy",
            "I'll sometimes read a message then forget to message back until like 7000 years later",
            "Superiority Complex.",
            "I think i'm better than people even though I know i'm not. whenever I notice it I remind myself that i'm not, but I still believe I am. I feel like it's so deeply rooted I won't ever get rid of that feeling. Not sure how to go about fixing it.",
            "I used to have that but I thought myself not to be like that, it really isn't that hard you pleb",
            "I'm a perfectoinist.",
            "Are you sure about that?",
            "Me Dick",
            "You thinking that your dick is a personality trait is probably your worst personality trait",
            "Are you also a caveman?",
            "Not giving in .... even when I'm damn sure that I'm right and my way is the best way, giving up a little to get agreement and buy-in from others is often a better way to go.",
            "Did you ever hear the tragedy of Darth Plagueis the Wise?",
            "I'm really fucking hostile with very little provocation.",
            "Yes, I am imagining all of the ways you could die tomorrow because you told me you had to cancel the outing I had planned for us one week ago. And yes, I know I'm a fucking terrible person for it. I don't know how to make it stop.",
            "I talk about myself too much. People tell me something interesting etc. and I always catch myself relating it to some experience I have also had (that is somewhat similar). It's bad",
            "I assume the worst and panic",
            "I care a lot more about people than they care about me (or anyone else). Often get burned for that.",
            "Im a pessimistic asshole",
            "Username checks out",
            "Lack of self confidence when it comes to dating. I'm trying to change that, but it's difficult.",
            "I'm compulsively secretive. Grew up queer in a super religious household, and now it makes me uneasy to let people know basically anything about what I'm up to.",
            "I don't listen well",
            "I don't like people.",
            "I judge whole people for individual actions.",
            "But don't think you should be judged for your individual actions. I catch myself doing that too",
            "Indifference.",
            "Meh",
            "I call it only child syndrome. So used to doing things alone that I prefer it, makes relationships hard because I catch myself getting annoyed just because my girlfriend wants to tag along with me somewhere.",
            "I'm pretty great at letting people walk over me/ give my happiness to other people. Really just I'm okay with being depressed",
            "Perfectionism",
            "I don't like people at all.",
            "I sometimes can't let something go. If I have been wronged I sometimes will go no contact even when it wasnt a big deal.",
            "Being obsessive about things, usually bad things :(",
            "I've lost the ability to delegate.",
            "I've been screwed so many times by someone else's ineptitude, I NEED to do everything myself, so it doesn't look like I'm pushing off blame if things go wrong.",
            "I'm the same way. I feel like I have to do everything myself because I can't count on others when they promise to help because they never follow through. I was always taught that if you want it done right, you have to do it yourself. But in my case, if I want it done at all, I have to do it myself.",
            "And it's a miracle that I haven't stabbed anyone who has uttered the phrase, \"Oh, I was just going to do that!\" immediately after I finish something they promised to do. No, you weren't. Don't give me that shit.",
            "I struggle with time management and flexibility. Last minute invitations make me more annoyed than I should be. Balancing my hobbies is a stressful nightmare.",
            "I have a very enthusiastic and kind personality to casual acquaintances and work friends, but I find myself so easily treating my closest relations (girlfriend, parents) with pettiness, impatience, and depressive responses. The \"why do we hurt the ones we love?\" scenario. It shames me to think of, but the different personalities appear so effortlessly depending on the other people involved.",
            "I'm incredibly hard on myself. People really like me and I do a great job on most things, but even the tiniest mistake is agony. I have an issue with self-harming because of it and I'm trying really hard to make it go away.",
            "D) All of the above",
            "Lack of motivation",
            "Probably that I like to ask a lot of people. Not when it comes to doing things for me, but for themselves. And I will gladly help, but I just ask a lot. Like if I were a teacher, I'd give a lot of homework for sure.",
            "That's a great answer to give in an interview for a management position.",
            "I am relentless when I want something done my way.",
            "Even though it should be complimented, I don't like how I'm too eager to do stuff. The main problem is that fact that I give myself too much stuff to do and it makes doing work feel like a slog. I'm learning to calm down with it, but I will do that time to time.",
            "Backseat driving. Not just for driving, but for any task that I know how to do and have to watch someone else do.",
            "Honest. To a fault.",
            "Lack of consistent follow through with ideas expressed or projects started or school or excersise.",
            "My thinking is very black-and-white. I can't just like something, i have to love it and i become obsessed. And when i dislike something/someone, i detest it/them. Have the same with my moods too.",
            "I hear you. I don't know what moderation means. It doesn't make sense.",
            "I'm greedy. My parents used to ground me for everything, and take away anything that I owned. I even get into arguments with my wife sometimes, because I don't like people touching my stuff. It's set in my mind that if I let someone touch something, they'll either ruin it or take it away.",
            "I have a gigantic temper",
            "I'm too giving towards other people and sometimes I forget to prioritize myself.",
            "I get grumpy for really no real reason at all.",
            "I'm very spiteful. If someone does something to me and I feel that it crosses the line, I can feel my heart rate go up and my mouth gets all tingly.",
            "I feel like I'm in control over my temper, but I'm filled with rage a lot of the time.",
            "I over-think and under-sleep",
            "I lack tact. People who know me know that I don't mean to be a dick and many actually appreciate my frankness but when people first meet me, they often think I am standoffish. It has really made dating difficult. I am not sure how to rein this personality quirk in. Do you \"nice\" people just go around hiding your thoughts and sugar-coating every utterance or am I really just a dick?",
            "I'm transparent about my feelings when I shouldn't be, and then I keep them secret when I shouldn't. Leads to oversharing and embarrassing myself to strangers and alienating the ones I love.",
            "My knee-jerk reaction is to be angry. For most people, I swallow it down and just move on. For people I'm closer to, it comes out more often. A lot of my friends have told me they were very surprised by how angry I actually can be once they got to know me better.",
            "I tend to take everything very personally, and get really upset about things that are no big deal. For instance, if I ask someone if they'd like to do something with me, and they refuse with totally reasonable explanation, I still feel like I said or did something wrong, and get really, really miserable. Well, until I get into contact with that person again to see that everything is ok.",
            "I'm careles and lazy and",
            "...and sometimes i finish other people's sentences.",
            "I have what my mother calls a 'selfish streak'. I am not a selfish person, but sometimes, I say do things that are rather quite selfish without knowing.",
            "procrastination and laziness caused from bored, which is why im on reddit",
            "I'm so nervous when thrown into a social situation and I become a stuttering mess that says the most ridiculous things and then people stare at me blankly not knowing how to respond.",
            "I never say sorry.",
            "I'm a timely person. So I tend to expect that from those around me. I'm disappointed often.",
            "fuck you",
            "Rudeness it is.",
            "I tend to get angry more often than I'd like. I've gotten better over the year by forcing myself to stop before I act, but sometimes I just go off",
            "I am too straightforward and honest in situations which need diplomacy and always get screwed because of that.",
            "I can be a major douche when I am messing around. And I can become really sarcastic and make snarky remarks when I get mad at someone.",
            "Honestly I hate it but I'm the \"edgy\" friend. Constantly doing things for shock value.",
            "I'm incredibly stubborn and hard-headed, traits I have inherited from my dad. Also, I have a tendency to overreact and make mountains out of molehills.",
            "I am very moody and Itms offputting to many people. People expect me to be happy all the time and kind of be like a 'blank space' with no opinions, sterilized political correctness and it makes me moody a lot",
            "Lack of patience (slips to end of books to find out the ending)",
            "Fidgeting (keep biting my fingernails and tapping my feet for some reason)",
            "Procrastination",
            "Distractions (usually it’s a video game or Twitter/Reddit and I end up doing my homework at 9pm)",
            "Feeling like the target of everyone's frustration or general bad mood",
            "I'm too sporadic sometimes, and it leads to me saying things I really shouldn't. I have been and will continue working on it, however. I also don't know when to stand up for myself or let it slide.",
            "I'm constantly cynical when I think about people's intentions.",
            "I'll meet someone through friends and think to myself, \"they didn't mean a word of what they just said.\" I even if they were super nice and pleasant, I'll think they didn't like me at all. It's a problem with my self-confidence which I've been working on improving.",
            "Bonus: I'm awkward as hell around attractive people.",
            "I've got a fairly good memory. Leads to.me holding grudges. A lot.",
            "hypercritical of myself and others",
            "I generally don't like people. That may come across whenever I meet someone.",
            "It takes me a while to get to defcon whichever defcon is the worst, but once I'm there, it takes me FOREVER to let go of it and calm back down again. I never cast the first stone in disagreements, but god help you if you insult or dismiss me in some way. I will replay the conversation and find a way to make my displeasure felt. Not vindictively, but fairly forcefully. People who can accept their imperfections and take responsibility for problems usually deal with this ok, but people who are insecure, hostile, defensive etc, really can't handle me when I am like this, and it has destroyed relationships and even a job. But I will not be put off if someone is acting unfairly. I CANNOT leave it be.",
            "I am also ridiculously inflexible about how I like things to be in my house. Complete contrast with how I am at work, where I am a total pragmatist.",
            "Sometimes I show off a bit too much. Which I then try to cover by making an awkward self-deprecating joke. But it's always obvious.",
            "I'm loyal to a fault. Often this leads me to being used to walked on for far too long before I finally give up.",
            "When I get upset by something minor, I refuse to talk about it until I'm grilled but I'm bad at hiding it too. (Despite this, i always understand that talking about it would solve the problem faster)",
            "It starts with one thing\nI can't get right\nBefore you know it I'm staying up all night\nkeeps playin' in my mind\nNow peace I can't find\nTo get to sleep in time\nAll I know\nTime is a valuable thing\nWatch it fly by instead of captured in dreams\nWatch it count down to the end of the night\nI think I'm a losing this fight",
            "It's so unreal\nRearrange my pillow\nWatch the time go right out the window\nTrying to clear my mind, but it just won't slow\nRacing thoughts won't leave me alone\nI kept everything inside\nAnd no matter how I try, it won't depart\nNow stuck inside of me\nAnd playing on repeat while I try to",
            "Get some sleep\nIn insomnia's keep\nIn my bed\nThis night lasts forever\nI can't sleep\nNot a peep\nIn my bed\nThis night lasts forever",
            "Way too kind and caring. I always get fucked over in the end.",
            "I'm persistent when trying to understand a new concept or when trying to solve any problem in general. I won't eat or sleep until I feel I've learned enough or I have resolved the problem.",
            "Impulsiveness. They stumble that run fast.",
            "I'm terrible at following through with almost anything that I start. Not sure why I'm this way. Advice is welcome.",
            "That my personality is inconsistent.",
            "I also don't feel effected by peer pressure. This may seem like a good thing but I also struggle to find interest in what others like with out having liked it all on my own or the lack of being influenced by those around me. Not being part of a hive mind feels like what ever I say pisses people off when I feel there wasn't a reason to be irritated.",
            "I like annoying people just to annoy them.",
            "I panic way too easily",
            "As well as being a pathological people pleaser I talk far too much to fill the silence.",
            "I'm definitely too forgiving, I let people get the best of me",
            "I'm extremely narcissistic, every time some one says something they did, had seen, or generally anything I end up bringing up something about me instead of engaging them. I honestly hate it.",
            "I don't like other people. At all. At the core of every relationship I have is a little nugget of hatred for the other person. I don't know why, it's just there.",
            "My social awkwardness in groups. It's strange, I'm usually fine interacting one on one but as soon as it's 4+ people involved I suck at reading groups dynamics and end up either withdrawing completely or making a fool of myself.",
            "Personally, if I'm mad at someone, I will start trying extra hard to take their responsibilities, do their work, and help them out so they can feel emotionally blackmailed into feeling terrible about themselves. I know it doesn't seem too bad, but I have used it to manipulate my way through quite a few situations!",
            "I don't know that does seem pretty bad to me man.",
            "If I can't win, I won't play.",
            "Just sounds like being smart.",
            "Sometimes when commenting I don't finish my",
            "Being a smartass.",
            "All of it",
            "Is \"hating everything\" a personality trait?",
            "People tell me I'm a good, well adjusted person and I let it get to my head. I'll catch myself thinking down on others and their actions as if I have some innate moral high ground just because some people think I'm kind and decent.",
            "jealousy",
            "Conflict avoidance",
            "I hate affection.",
            "My lack of a personality",
            "My face",
            "A lot of people say I'm way too opinionated. I take that as a compliment, but others say that its not.",
            "I'm lazy",
            "Extreme arrogance at defending what I feel I know to be wrong combined with extreme unwillingness to do anything about it.",
            "I interrupt people talking to ask questions and i sometimes seem uninterested too",
            "Meekness. I'm too worried about offending people.",
            "Obsessiveness.",
            "I get an unhealthy amount of joy from pushing people's buttons.",
            "Either the fact that I constantly share TMI, or my terrible habit of pointing out all of my mistakes to others.",
            "I'm a very mellow person but I repress A LOT so every six months or so I snap, sometimes justified sometimes not.",
            "Being selfish",
            "I lack empathy.",
            "Abysmally low self esteem.",
            "toss up between my ability to want to maintain friendships or that i rarely stand up for myself, im pretty passive but that leads people to assume 100% control of everything involving me because i just feel like arguing and fighting alllll the time is exhausting and dumb",
            "I am very insecure in my relationships with people for no real reason",
            "Negativity and \"it'll never work\"-attitude. Or as most people know it, \"being realistic\".",
            "In my job I've learned to detect and weed out worst-case-scenarios and magical thinking and other \"fantastical bullcrap\".",
            "And as a result I continue doing the same even on my free time. I guess it's useful or even necessary at work, but if you can't switch it off it makes the world look pretty bleak.",
            "I'm too emotional. It's not bipolar disorder but fuck some times I get so sad and it fucks up my whole day and some times I get so excited that I do stupid shit or don't think things through.",
            "I'm very warm and compassionate and people feel like they can open up to me. But on the opposite end I feel like that also limits me, I feel like for many people I'm a warm person they can open up to but not care to open themselves.",
            "I don't get too choked about this because of course having people open up to you is always nice, but I always feel like it's not like I don't have a wall, but my wall is further back giving the illusion that I don't have one and people are seeing all of me.",
            "I think I have a good speaking voice, but half the time people can't understand me.",
            "I hate to be that guy, but someone has to do it. Nothing",
            "Pessimistic. Cynical. Anxious. Reclusive.",
            "I stop caring very much about something if there is nothing positive to gain, and the positive gain is my drive to do things I do.",
            "I limit myself.",
            "I'm a horrible pedant. I know it, and I love it most of the time, but it gets me in tons of fights.",
            "I'm such a little bitch. You'll hear me talk about how I'll punch anyone who tries to fight me but I cry at any confrontation. Even when I get mad, I'm close to tears.",
            "I am pretty chill but when I lose it, I really lose it! No middle ground when it comes to my anger.",
            "Learned helplessness and lack of drive.",
            "I blame helicopter parents.",
            "Negative side: I don't let things go, sometimes zero chill. On the good side though this helps me actually follow through with some things because i persevere through a lot too.",
            "I'm told I always sound bored and this makes people think I don't like them.",
            "I just don't give a fuck.",
            "Never satisfied if I see someone I consider to be more of an ass than I am having something better than what I have. Luckily, I have lots of nice things, but there's always an ass with something better to come across.",
            "I can't start or even come near girls, to speak, like i saw a studentworker at my workplace and cannot aproach her. But sitting on the bus and hearing a girl chatting away, i could easily join in my mind",
            "I make way too many jokes when I shouldn't. Get's me in trouble all the time.",
            "Too easily distracted",
            "Hey look, a sparkly item is over there!",
            "points off in the distance",
            "Probably that I turn things around in people and make it their fault if I'm feeling defensive - not proud of that and I certainly work on being aware of it. But that's the worst one, I know because my parents would do that to me all the time.",
            "I give up too easily.",
            "Lack of empathy.",
            "I really don't care that your parents are getting divorced and your family's falling apart, please stop dating me now, I don't want to deal with the drama.",
            "Jealousy",
            "I wish my worst trait was jealousy...",
            "\"Huh this girl laughed at my joke nice!....wait she laugh at that dude's joke too!, get off her she's MINE!\"",
            "Bro WTF are you doing in this thread? Why aren't you hanging out with me?",
            "I hold grudges for a long time.",
            "THIS. Absolutely. I'm still angry at some people who were mean to me in fourth grade.",
            "Fuck I'm the completely opposite.",
            "Guy told me to kill myself in league? Makes a good play later, \"GJ Bro\"",
            "I get stressed out too easily.",
            "Don't be too hard on yourself. I BELIEVE IN YOU.",
            "I'm awkward.",
            "I have what has been described as \"a heart for animals.\" Now this seems all fine and dandy, but people are annoyed when I try to convince them to literally not hurt a fly, or when I am constantly worried about others people's pets after seeing that their owners don't know how to properly (not that they are doing it completely wrong) take care of them, or that I cry and get super depressed whenever I even so much as read something about animal abuse.",
            "There's nothing wrong with that at all.",
            "Unless it's a spider.",
            "I'm to scared to do anything beneficial in my life for fear of failure, It's easier at least for me to sit behind a veil of unknown rather then knowing I'm bad at something.",
            "I feel ya. Same issue, and apparently for me it just makes me obviously come off as awkward or nervous to employers.",
            "I tend to believe people do things that harm me on purpose.",
            "Pride. Whenever I think I have everything together or whenever I get to cocky, I am promptly thrown off my pedestal onto the dirt. Honestly, I don't have much to be prideful about.",
            "I get unjustifiably angry when people ask me what I perceive to be dumb questions.",
            "I have trouble thinking of things to say. A lot of people attribute this to being anti-social, but that's not necessarily the case with me. I want to be social, I want to communicate with others and partake in meaningful discussions. Hell, I'd settle for small talk if nothing else. The problem is that I can't come up with topics for conversation that feel either relevant or worthwhile, and on the rare occasion that I do, I usually convince myself not to say anything.",
            "I'm usually pretty good at talking to others as long as they have things to say to me that naturally require responses. But if it's up to me to say something from the get-go, things are more than likely staying quiet.",
            "If I get criticized I take it too seriously and I later relive the scenario in my mind and my heart pumps hard and I get pissed off",
            "I'm a grump, I just don't like to be around people for a long time and I start to get grumpy and mean. The problem is, I'm around people basically all the time, so I hate everyone.",
            "I'm charming which doesn't sound bad but if you don't like getting to intimate with people or don't trust people like me is really bad because everyone wants to talk to you or hang out with you and I just want to be left alone.",
            "Impatient and angry most of the time. Just because of these two traits I'm a recluse as well.",
            "I'm shitty at keeping in contact with people if they don't initiate contact more often than not. I get engrossed in my daily grind and when I realize I haven't talked to someone in a while, I assume they don't want to talk to me and never contact them.",
            "Not wanting to grow up!",
            "I feel like my -10 to medicine is really holding me back.",
            "Always wanting to please others.",
            "Either that I have a hard time correctly expressing my emotions to others in any form other than writing or that it's very difficult for me to ask for help or emotional support.",
            "I can be a total dick ... alot...",
            "I don't like to agree to disagree. There can be only one.",
            "I have a tendency to have strong feelings for female friends no matter how many",
            "Anger. I don't let it get the best of me but sometimes I just want to totally unleash and break everything in sight.",
            "I am really judgemental",
            "Complete and utter apathy.",
            "I think I care too much about what others think of me.",
            "I correct everyone. Everytime. Even if I don't know myself. I just really want to tell people that they're wrong, and make myself feel smarter.",
            "I'm too self oriented. I don't necessarily do it consciously, but I spend most waking moments in pursuit of self betterment in order to finally find someone to fall in love with.",
            "I'm a gay guy too so I tend to emulate the traits I find most attractive in men; this can lead to me appearing self obsessed (if anything it's the opposite).",
            "However, the fact I tend to ask people for feedback on my character (presentation of masculinity, my accent etc) tends to lead people to think I'm narcissistic. I honestly don't think I am; I just about my demeanour a bit too much due to fear of ridicule.",
            "I'm cynical yet hopeful and sometimes I have cognitive dissonances.",
            "Either my almost anti-social behaviour or my gullibility.",
            "I'm a cunt",
            "Attention! Please keep in mind that the OP of this thread has chosen to mark this post with the [Serious] replies only tag, therefore any replies that are jokes, puns, off-topic, or are otherwise non-contributory will be removed.",
            "If you see others posting comments that violate this tag, please report them to the mods!",
            "Thanks for your cooperation and enjoy the discussion!",
            "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
            "I get attached to someone quickly than most.",
            "I worry too much. A lot of times I'll overthink something so much that I'll ruin opportunities for myself before they can happen. Working on it, though.",
            "I'm a perfectionist.",
            "I have no concept of nervousness or embarrassment. I can walk up to a crowd of strangers and feel comfortable. Speaking in front of groups doesn't bother me. I have no skeletons in my closest because I don't hide anything.",
            "I compare myself to others way too much, therefore, I become disappointed with myself because I don't seem to be doing as well as others.",
            "I'm not very confident in myself. People always tell me that I'm good at this or that but I feel as though they are just saying it to make me feel better about myself.",
            "Lying...",
            "or is it?",
            "Ha. You think I have a consistent enough character trait to think something about me is bad..it's all good, I can change.",
            "Dismissive and cynical.",
            "Perception.",
            "Attention! [Serious] Tag Notice",
            "Jokes, puns, and off-topic comments are not permitted in any comment, parent or child.",
            "Parent comments that aren't from the target group will be removed, along with their child replies.",
            "Report comments that violate these rules.",
            "Posts that have few relevant answers within the first hour, and posts that are not appropriate for the [Serious] tag will be removed. Consider doing an AMA request instead.",
            "Thanks for your cooperation and enjoy the discussion!",
            "I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
            "Ricky from TPB meets Burt Gummer with a dash of Larry the Cable Guy.",
            "chilled",
            "Stereotypical nerd. Inability to converse with females included",
            "Outgoing introvert clown",
            "Socially anxious when around new people or environments, but funny and outgoing once the ice is broken. Afraid of commitment, open minded/skeptical and extremely indecisive on little things.",
            "Stubborn as a mule, loving as a dove, and as lonely as an owl.",
            "Babbling brook personified",
            "Boring.",
            "I'm gregarious when I have a little drink in me, witty, can be really in my own head. I'm impulsive sometimes to the point of recklessness. I've got one hell of a wild hair, too. I'm loyal to my friends and god help my adversaries. I enjoy making other people happy when I can.",
            "30% asshole, 20% teddy bear, 50% funny.",
            "Bad. Abrasive, like sandpaper. Talking or being with me is kind of like...walking on gravel with bare feet. You come away from talking to me and likely feel drained of energy. Some people might make people happy, but I'm like a gaseous cloud of negative energy.",
            "Low light? No problem.",
            "Some of the best times happen when the sun’s down. Capture the night with crystal-clear, bright pics and videos, no matter the lighting with Nightography.",
            "Real moments in really high resolution",
            "Capture everyday moments and immortalize them as epic memories in stunning 8K Video, the highest resolution available on a smartphone.",
            "Smooth. Bright. Epic.",
            "Your favorite content will look even more epic on our brightest display ever with Vision Booster. Whether you’re editing video, staging a shot or simply streaming your favorite show, Galaxy S22 Ultra will make it all pop."
}
